Repository: JospenWolongwo/hello-hardware
Catalog: apps/client-back-office/src/locale/messages.*.xlf
Languages: fr

source: Product Categories
fr: Catégories

source: Products
fr: Produits

source: Stores
fr: Magasins

# storeUsers
source: Stores Users
fr: Employés

source: Orders
fr: Commandes

source: navbar
fr: barre de navigation

source: search
fr: rechercher

source: settings
fr: paramètres

source: account menu
fr: menu du compte

source: logout
fr: déconnexion

# logoutText
source: Logout
fr: Déconnexion

# searchTitle
source: search {{ searchEntity }}
fr: rechercher des{{ searchEntity }}

# searchText
source: Search
fr: Rechercher des

source: sidebar
fr: barre latérale

# firstPageLabel
source: First page
fr: Première page

# itemsPerPageLabel
source: Items per page:
fr: Éléments par page:

# lastPageLabel
source: Last page
fr: Dernière page

# nextPageLabel
source: Next page
fr: Page suivante

# pageNumber0
source: Page 1 of 1
fr: Page 1 sur 1

# pageNumberN
source: Page page + 1 of numberOfPages
fr: Page page + 1 sur numberOfPages

source: Name
fr: Nom

# createCategoryPlaceholder
source: Enter category name...
fr: Saisir le nom de la catégorie...

# ariaLabelCategoryNameInput
source: Enter a category name
fr: Saisir un nom de catégorie

# fieldRequiredError
source: This field is required.
fr: Ce champ est obligatoire.

# ariaLabelCategoryDescriptionInput
source: Enter a description for the category
fr: Saisir une description de la catégorie

# closeButtontext
source: Close
fr: Fermer

# productCategoriesItemLabel
source: Product categories per page:
fr: Catégories de produits par page:

# productCategoryTableTitle
source: PRODUCT CATEGORY
fr: CATÉGORIE DE PRODUITS

# addCategory
source: Add a category
fr: Ajouter une catégorie

# addCategoryButton
source: New Category
fr: Nouvelle catégorie

# productCategoryTable
source: Product categories
fr: Catégories de produits

# nameColumn
source: Name
fr: Nom

# subCategoryColumn
source: Sub-categories
fr: Sous-catégories

# createdAtColumn
source: Created At
fr: Créé le

# updatedAtColumn
source: Updated At
fr: Mis à jour le

# addSubCategory
source: Add a new sub-category to this category
fr: Ajouter une nouvelle sous-catégorie à cette catégorie

# addSubCategoryButton
source: New sub-category
fr: Nouvelle sous-catégorie

# viewCategory
source: View this category
fr: Voir cette catégorie

# viewButton
source: View
fr: Voir

# editCategory
source: Edit this category
fr: Modifier cette catégorie

# editButton
source: Edit
fr: Modifier

# deleteCategory
source: Delete this category
fr: Supprimer cette catégorie

# deleteButton
source: Delete
fr: Supprimer

# successPopUpMessageTitle
source: Success
fr: Succès

# createdProductSubCategoryMessage
source: The newCategory.name sub-category was successfully added to the parent.name category.
fr: La sous-catégorie newCategory.name a été ajoutée avec succès à la catégorie parent.name.

# editProductCategoryMessage
source: The category was successfully edited.
fr: La catégorie a été modifiée avec succès.

# createProductCategoryModalTitle
source: New product category
fr: Nouvelle catégorie de produits

# createAction
source: Create
fr: Créer

# categoryCreationModal
source: Product category creation Modal
fr: Modal Création d'une catégorie de produits

# createProductSubCategoryModalTitle
source: New product sub-category of parentName
fr: Nouvelle sous-catégorie de parentName

# subcategoryCreationModal
source: Product sub-category creation modal
fr: Modale de création de sous-catégories de produits

# editProductCategoryModalTitle
source: Edit categoryName category
fr: Modifier la catégorie categoryName

# editAction
source: Edit
fr: Modifier

source: Edit category modal
fr: Modale d'édition de la catégorie

# editProductCategoryConfirmationMessage
source: Are you sure you want to edit the categoryName category?
fr: Êtes-vous sûr de vouloir modifier la catégorie categoryName?

source: View category modal
fr: Voir la catégorie modale

# ViewCategoryModalTitle
source: View Category
fr: Voir la catégorie

# ariaLabelCategoryId
source: category id
fr: identifiant de la catégorie

# ariaLabelCategoryName
source: category name
fr: nom de la catégorie

# ariaLabelCategoryDescription
source: category description
fr: description de la catégorie

# ariaLabelCategoryParent
source: category' parent name
fr: nom du parent de la catégorie'

# parent
source: Parent Name
fr: Nom du parent

# ariaLabelCategorySubCategories
source: category' sub-categories
fr: Catégorie' de sous-catégories

source: Sub-categories
fr: Sous-catégories

# ariaLabelCategoryCreationDate
source: category' creation date
fr: Date de création de la catégorie'

source: Creation Date
fr: Date de création

# ariaLabelCategoryUpdateDate
source: category' update date
fr: date de mise à jour de la catégorie'

# updateDate
source: Last Update date
fr: Date de la dernière mise à jour

source: Step 1
fr: Étape 1

# ariaLabelProductCodeInput
source: Enter product code
fr: Saisir le code du produit

# alphaNumericFieldError
source: This field takes only alphanumeric values.
fr: Ce champ n'accepte que des valeurs alphanumériques.

source: Product name
fr: Nom du produit

# ariaLabelProductNameInput
source: Enter product name
fr: Saisir le nom du produit

source: Brand
fr: Marque

source: Product brand
fr: Marque du produit

# ariaLabelProductBrandInput
source: Enter product brand
fr: Saisir la marque du produit

# nextButtontext
source: Next
fr: Suivant

source: Step 2
fr: Étape 2

# ariaLabelProductDescriptionInput
source: Enter a description for the product
fr: Saisir une description du produit

# fieldMinLengthError
source: This field is should be at least {{ descriptionMinLength }} characters long.
fr: Ce champ doit être d'au moins {{ descriptionMinLength }} caractères.

# backButtontext
source: Back
fr: Retour

source: Step 3
fr: Étape 3

# minPrice
source: Minimum Price
fr: Prix minimum

# productMinPrice
source: Enter price in $
fr: Entrer le prix en $

# ariaLabelProductMinPriceInput
source: Enter the product minimum price in dollar
fr: Saisir le prix minimum du produit en dollars

# fieldGreaterThanZeroError
source: This field value should be greater than 0.
fr: La valeur de ce champ doit être supérieure à 0.

# maxPrice
source: Maximum Price
fr: Prix maximum

# productMaxPrice
source: Enter price in $
fr: Entrer le prix en $

# ariaLabelProductMaxPriceInput
source: Enter the product maximum price in dollar
fr: Saisir le prix maximum du produit en $

source: step 4
fr: étape 4

source: Final Step
fr: Dernière étape

source: store
fr: magasin

# selectStore
source: Select a store
fr: Sélectionner un magasin

source: category
fr: catégorie

# selectCategory
source: Select a category
fr: Sélectionner une catégorie

source: Gallery
fr: Galerie

source: Product gallery
fr: Galerie de produits

# ariaLabelProductGalleryInput
source: Enter the product gallery
fr: Entrer dans la galerie de produits

# productsItemLabel
source: Products per page:
fr: Produits par page:

# productTableTitle
source: PRODUCTS
fr: PRODUITS

# deactivateProductsToolTip
source: Deactivate selected products
fr: Désactiver les produits sélectionnés

# ariaLabelDeactivateProductsButton
source: Deactivation of products button
fr: Bouton de désactivation des produits

# activateProductsToolTip
source: Activate selected products
fr: Activer les produits sélectionnés

# ariaLabelActivateProductsButton
source: Activation of products button
fr: Activation du bouton des produits

# addProductToStore
source: add a product to a store
fr: ajouter un produit à un magasin

# addProductButton
source: Add Product
fr: Ajouter un produit

# productsTable
source: Products
fr: Produits

# galleryColumn
source: Gallery
fr: Galerie

# brandColumn
source: Brand
fr: Marque

# categoryColumn
source: Category
fr: Catégorie

# statusColumn
source: Status
fr: Statut

source: Active product
fr: Produit actif

source: Disabled product
fr: Produit désactivé

# viewStockButton
source: View stocks
fr: Voir les stocks

# editProduct
source: Edit this product
fr: Modifier ce produit

# viewProduct
source: View this product
fr: Voir ce produit

# errorPopUpMessageTitle
source: Error
fr: Erreur

# errorModal
source: An error occurred
fr: Une erreur s'est produite

# editProductMessage
source: The product was successfully edited.
fr: Le produit a été modifié avec succès.

# createProductModalTitle
source: Create a Product
fr: Créer un produit

source: Add product modal
fr: Modale d'ajout de produit

# editModalAction
source: Edit
fr: Modifier

source: Edit product modal
fr: Modalité d'édition du produit

# editProductConfirmationMessage
source: Are you sure you want to edit the productData.name product?
fr: Êtes-vous sûr de vouloir modifier le produitproductData.name?

# activateProductsConfirmationMessage
source: Are you sure you want to activate the selected product(s)?
fr: Êtes-vous sûr de vouloir activer le(s) produit(s) sélectionné(s)?

# deactivateProductsConfirmationMessage
source: Are you sure you want to deactivate the selected product(s)?
fr: Êtes-vous sûr de vouloir désactiver le(s) produit(s) sélectionné(s)?

source: View product modal
fr: Voir le produit modal

# ViewProductModalTitle
source: View Product
fr: Voir le produit

# ariaLabelProductId
source: product id
fr: Identifiant du produit

# ariaLabelProductCode
source: product code
fr: code du produit

# ariaLabelProductName
source: product name
fr: nom du produit

# ariaLabelProductBrand
source: product brand
fr: marque du produit

# ariaLabelProductGallery
source: product gallery
fr: galerie du produit

# ariaLabelProductCategory
source: product category
fr: catégorie du produit

# ariaLabelProductStore
source: product store
fr: magasin de produits

# ariaLabelProductMinPrice
source: product minimum price
fr: prix minimum du produit

source: Minimum Price
fr: prix minimum

# ariaLabelProductMaxPrice
source: product maximum price
fr: prix maximum du produit

source: Maximum Price
fr: Prix maximum

# ariaLabelProductStatus
source: product status
fr: statut du produit

source: Status
fr: Statut

source: Unit
fr: Unité

# measurementInput
source: Enter a measuring unit...
fr: Entrez une unité de mesure...

# ariaLabelStockUnitInput
source: Enter a unit
fr: Entrer une unité

# price
source: Unit Price($)
fr: Prix unitaire ($)

# ariaLabelStockUnitPriceInput
source: Enter the stock unit price
fr: Saisir le prix unitaire de l'action

# fieldLessThanMaximumError
source: This field value should be less than {{ maxPrice }}.
fr: La valeur de ce champ doit être inférieure à {{ maxPrice }}.

source: Quantity
fr: Quantité

# ariaLabelStockQuantityInput
source: Enter the stock quantity
fr: Saisir la quantité de stock

# stockItemLabel
source: Product stocks per page:
fr: Nombre de produits par page:

# addStock
source: Add product stock
fr: Ajouter un stock de produits

# addStockButton
source: New Stock
fr: Nouveau stock

# productStockTable
source: Product stocks
fr: Stock de produits

# unitColumn
source: Unit
fr: Unité

# priceColumn
source: Price
fr: Prix

# quantityColumn
source: Quantity
fr: Quantité

# editStockModalTitle
source: Edit this.productName.toUpperCase() stock quantity
fr: Modifier la quantité de stock du produit this.productName.toUpperCase()

# updateAction
source: Update
fr: Mise à jour

source: Edit stock quantity modal
fr: Modal de modification de la quantité en stock

# warningPopUpMessageTitle
source: Warning
fr: Avertissement

# errorStockUpdateMessage
source: The this.productName.toLocaleUpperCase() stock has nothing to update.
fr: Le produit this.productName.toLocaleUpperCase() en stock n'a rien à mettre à jour.

source: View product stock modal
fr: modal de voir le produit stock

source: Edit stock modal
fr: Modal d'édition du stock

# createStockModalTitle
source: Add a stock for this.productName.toUpperCase()
fr: Ajouter un stock pour le produit this.productName.toUpperCase()

source: Add stock modal
fr: modal d'ajout de stock

# ViewStockModalTitle
source: View {{ data.product.name.toLocaleUpperCase() }} Stock
fr: Voir le produit {{ data.product.name.toLocaleUpperCase() }} en Stock

# ariaLabelStockId
source: stock id
fr: identifiant du stock

# ariaLabelStockUnit
source: stock unit
fr: unité de stock

# ariaLabelStockPrice
source: stock price
fr: prix du stock

# ariaLabelStockQuantity
source: stock quantity
fr: quantité du stock

# ariaLabelStockCreationDate
source: stock's creation date
fr: date de création du stock's

# ariaLabelStockUpdateDate
source: stock' update date
fr: date de mise à jour du stock's

# storeUserTableTitle
source: STORE USERS
fr: EMPLOYES

# ariaLabelDeactivatePermissionsButton
source: Deactivation of permissions button
fr: Bouton de désactivation des autorisations

# ariaLabelActivatePermissionsButton
source: Activation of permissions button
fr: Activation du bouton d'autorisation

# storeUserPermissionsTable
source: Store user's permissions
fr: autorisation d'tilisateur's de magasin

# permissionColumn
source: Permission
fr: Autorisation

# ariaLabelActivePermission
source: Activated permission
fr: Autorisation activée

# ariaLabelNonActivePermission
source: Deactivated permission
fr: Autorisation deactivée

# successPermissionActivation
source: Permissions successfully activated.
fr: Autorisation deactivée

# successPermissionDeactivation
source: Permissions successfully deactivated.
fr: Les autorisations ont été désactivées avec succès.

# activatePermissionsConfirmationMessage
source: Are you sure you want to activate the selected permission(s)?
fr: Êtes-vous sûr de vouloir activer les autorisations sélectionnées?

# activationErrorTitle
source: Permissions already active
fr: Permissions déjà actives

# activationErrorMessage
source: The permissions selected were already activated.
fr: Les autorisations sélectionnées étaient déjà activées.

# errorPermissionModal
source: can not active activated permissions.
fr: ne peut pas activer les permissions activées.

# deactivatePermissionsConfirmationMessage
source: Are you sure you want to deactivate the selected permission(s)?
fr: Êtes-vous sûr de vouloir désactiver les autorisations sélectionnées?

# deactivationErrorTitle
source: Permissions already deactivated
fr: Permissions déjà désactivées

# deactivationErrorMessage
source: The permissions selected were already deactivated.
fr: Les autorisations sélectionnées étaient déjà désactivées.

# deactivationErrorModal
source: can not deactive activated permissions.
fr: ne peut pas désactiver les autorisations activées.

# permissionsLabel
source: Permissions per page:
fr: Autorisations par page:

source: User email...
fr: E-mail de l'employé...

# emailFormatError
source: The email address is incorrect.
fr: E-mail de l'employé...

# storeUsersItemLabel
source: Store users per page:
fr: Enregistrez les employés par page:

# ariaLabelDeactivateStoreUsersButton
source: Deactivation of store users button
fr: Bouton de désactivation des employés du magasin

# ariaLabelActivateStoreUsersButton
source: Activation of store users button
fr: Activation du bouton des employés

# inviteUserToStore
source: invite someone to a store
fr: inviter quelqu'un à un magasin

# inviteUserButton
source: Invite a User
fr: Inviter un employé

# storeUsersTable
source: Store users
fr: employés du magasin

# firstNameColumn
source: First Name
fr: Prénom

# lastNameColumn
source: Last Name
fr: Nom

# genderColumn
source: Gender
fr: Genre

# activeColumn
source: Active
fr: Actif

# activeStoreUser
source: Active user
fr: employé actif

# disabledStoreUser
source: Disabled user
fr: employé désactivé

# editPermissionsButton
source: Edit Permissions
fr: Modifier les autorisations

# viewStoreUser
source: View this store user
fr: Voir cet employé

# activateUserConfirmationMessage
source: Are you sure you want to activate the selected user(s)?
fr: Êtes-vous sûr de vouloir activer le(s) employé(s) sélectionné(s) ?

# deactivateUserConfirmationMessage
source: Are you sure you want to deactivate the selected user(s)?
fr: Êtes-vous sûr de vouloir deactiver le(s) employé(s) sélectionné(s) ?

# sendInvitationModalTitle
source: Send an Invitation
fr: Envoyer une invitation

# sendAction
source: Send
fr: Envoyer

source: View store user modal
fr: Modale d'affichage de l'employé

# ViewStoreUserModalTitle
source: View Store User
fr: Voir l'employé

# ariaLabelStoreUserId
source: store user id
fr: identifiant de l'employé

# ariaLabelStoreUserName
source: store-user name
fr: nom de l'employé

# ariaLabelStoreUserGender
source: store user gender
fr: genre de l'employé

source: Gender
fr: Genre

# ariaLabelStoreUserStoreName
source: store user's store name
fr: nom d'employé's de magasin

# ariaLabelStoreUserPhoneNumber
source: store user's phone number
fr: numéro de téléphone d'employé's de magasin

source: Phone Number
fr: Numéro de téléphone

source: Permissions
fr: Autorisations

# ariaLabelStoreUserStatus
source: store user's status
fr: statut d'employé's de magasin

# ariaLabelStoreNameInput
source: Enter a store name
fr: Entrer un nom de magasin

# ariaLabelStoreDescriptionInput
source: Enter a description for the store
fr: Entrez une description pour le magasin

# storesItemLabel
source: Stores per page:
fr: Magasins par page:

# storeTableTitle
source: STORE
fr: MAGASIN

# addStore
source: Add a store
fr: Ajouter un magasin

# addStoreButton
source: New Store
fr: Nouveau magasin

# storeTable
source: stores
fr: magasins

# addBranch
source: Add a new branch to this store
fr: Ajouter une nouvelle branche à ce magasin

# addBranchButton
source: New branch
fr: Nouvelle branche

# viewStore
source: View this store
fr: Voir ce magasin

# editStore
source: Edit this store
fr: Modifier ce magasin

# deleteStore
source: Delete this store
fr: Supprimer ce magasin

# createdStoreMessage
source: The newStore.name[0].toLocaleUpperCase() + newStore.name.slice(1) store was successfully added.
fr: Le magasin newStore.name[0].toLocaleUpperCase() + newStore.name.slice(1) a été ajouté avec succès.

# createdBranchMessage
source: The newStore.name branch was successfully added to the parent.name store.
fr: La branche du magasin newStore.name a été ajouté avec succès au magasin parent.name.

# editStoreMessage
source: The store was successfully edited.
fr: Le magasin a été modifié avec succès.

# createStoreModalTitle
source: New Store
fr: Nouveau magasin

source: Store creation Modal
fr: Modale de création de magasin

# createBranchModalTitle
source: New branch of parentName
fr: Nouvelle branche de parentName

# branchCreationModal
source: Store's Branch creation Modal
fr: Création de branche Modal du Magasin's

# editStoreModalTitle
source: Edit storeName store
fr: Modifier le magasin storeName

source: Edit store modal
fr: Modalité d'édition du magasin

# editStoreConfirmationMessage
source: Are you sure you want to edit the storeName store?
fr: Êtes-vous sûr de vouloir modifier le magasin storeName?

source: View store modal
fr: Voir le magasin modal

# ViewStoreModalTitle
source: View Store
fr: Voir le magasin

# ariaLabelStoreId
source: store id
fr: Identifiant du magasin

# ariaLabelStoreDescription
source: store description
fr: description du magasin

# ariaLabelStoreParentName
source: store's parent name
fr: nom du parent du magasin's

# ariaLabelStoreCreationDate
source: store's creation date
fr: date de création du magasin's

# ariaLabelStoreUpdateDate
source: store's update date
fr: date de mise à jour du magasin's

# modalYesButtonText
source: Yes
fr: Oui

# modalNoButtonText
source: No
fr: Non

# successModal
source: Successful Operation
fr: Opération réussie

# confirmationModal
source: Confirm operation
fr: Confirmer l'opération
